In [2]:
#Pandas DataFrame is 2d array or just like row and columns in a table

import pandas as pd

mydata={
    "cars":["Safari","Scorpio","Bolero"],
    "years":[2,3,4]
}
df=pd.DataFrame(mydata)
df

      cars  years
0   Safari      2
1  Scorpio      3
2   Bolero      4

In [3]:
#pandas dataframe with indexing
mydata={
    "Calories":[450,345,234,567,123,457],
    "Duration":[120,105,90,150,67,121]
}
df=pd.DataFrame(mydata,index=["Sunday","Monday","Tuesday","Wednesday","Thursday","Friday"])
df

           Calories  Duration
Sunday          450       120
Monday          345       105
Tuesday         234        90
Wednesday       567       150
Thursday        123        67
Friday          457       121

In [5]:
print(df.loc["Friday"])

Calories    457
Duration    121
Name: Friday, dtype: int64

In [6]:
print(df.loc["Wednesday"])

Calories    567
Duration    150
Name: Wednesday, dtype: int64

In [7]:
#extract rows
mydata={
    "StudName":["Vijay","Ankit","Deepesh","Aman","Mayank"],
    "StuMarks":[90,87,78,65,56]
}
df=pd.DataFrame(mydata)
df

  StudName  StuMarks
0    Vijay        90
1    Ankit        87
2  Deepesh        78
3     Aman        65
4   Mayank        56

In [8]:
print(df.loc[2])

StudName    Deepesh
StuMarks         78
Name: 2, dtype: object

In [9]:
print(df.loc[[0,2]])

  StudName  StuMarks
0    Vijay        90
2  Deepesh        78

In [11]:
print(df.loc[0:2])

  StudName  StuMarks
0    Vijay        90
1    Ankit        87
2  Deepesh        78